
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/naokichin/aws-ecs-terraform/actions/runs/5162787049)



<pre><code>Apply complete! Resources: 3 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0f9c07a8c815600ad]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0394d7d021b9cee67]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-06964098bf82f17d8]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0484c65d56c312aef]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0edb7c4647f2a2bc7]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-09af8f91776c38a83]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0f93c273ac6260b2f]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-00c2c9d62fba11d31]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-01b1e81a483b996ae]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-07b9b3e7c1bec06dd]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-05f6d219b74a73e42]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-0dbcdd1e5e2be2539]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0d646a0f32af9545a]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-0cc115bd28689188f]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-00c2c9d62fba11d311080289494]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0afaade15c0cd691f]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0e21b23fd2ec88248]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-057dfecc352214f4e]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0907aad5a5e87d8ca]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-0c3f25bb5ebb606c3]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0b8c300fdada68bb3]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-0dbcdd1e5e2be25391080289494]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-05f6d219b74a73e421080289494]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_security_group.alb will be created
  + resource "aws_security_group" "alb" {
      + arn                    = (known after apply)
      + description            = "For ALB."
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all to outbound."
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow HTTP from ALL."
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "go-simple-server-alb"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "go-simple-server-alb"
        }
      + tags_all               = {
          + "Name" = "go-simple-server-alb"
        }
      + vpc_id                 = "vpc-0f9c07a8c815600ad"
    }

  # aws_security_group.ecs will be created
  + resource "aws_security_group" "ecs" {
      + arn                    = (known after apply)
      + description            = "For ECS."
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all to outbound."
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "go-simple-server-ecs"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "go-simple-server-ecs"
        }
      + tags_all               = {
          + "Name" = "go-simple-server-ecs"
        }
      + vpc_id                 = "vpc-0f9c07a8c815600ad"
    }

  # aws_security_group_rule.ecs_from_alb will be created
  + resource "aws_security_group_rule" "ecs_from_alb" {
      + description              = "Allow 8080 from Security Group for ALB."
      + from_port                = 8080
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 8080
      + type                     = "ingress"
    }

Plan: 3 to add, 0 to change, 0 to destroy.
aws_security_group.ecs: Creating...
aws_security_group.alb: Creating...
aws_security_group.ecs: Creation complete after 4s [id=sg-01cd8352bdecb0981]
aws_security_group.alb: Creation complete after 5s [id=sg-039646b7f9fcf52ca]
aws_security_group_rule.ecs_from_alb: Creating...
aws_security_group_rule.ecs_from_alb: Creation complete after 1s [id=sgrule-3270240793]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 3 added, 0 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":3,"Program":"tfcmt","SHA1":"08436faf1bcc80726433c17b4f536478d0523c95","Vars":{},"WorkflowName":"Terraform"} -->